/*****************************************************************************
	System Name	: Arduino 2009
	File Name	: SYS_main.c
	Content		: ÉÅÉCÉìèàóù
	Version		: 0.0
	CPU board	: Arduino Duemilanove
	Compiler	: 
	OS			: none
	Programmer	: Meow
	Copyleft (c)2009 Meow
	History		:2009/08/xx
*****************************************************************************/
/*==========================================================================*/
/*	Includes																*/
/*==========================================================================*/
#include "defSYS.h"
#include "defAPP.h"
#include "defCRT.h"
#include "defCSL.h"
#include <avr/interrupt.h>

/*==========================================================================*/
/*	function prototype														*/
/*==========================================================================*/
void SYS_main( void );

/*==========================================================================*/
/*	Program																	*/
/*==========================================================================*/
/*----------------------------------------------------------------------------
* Function : Main Proc.
* Descr	   : 
* Inputs   : 
* Outputs  : 
* Return   : 
*---------------------------------------------------------------------------*/
int main( void )
{
	A_SYS_Ini();
	A_APP_Ini();
	A_CRT_Ini();
	A_CSL_Ini();
	SYS_iniINT();
	
	UB_isCSL_MON = 0;
	f_blink_req = 1;
	f_scroll_req = 0; 
	f_mon_req = 0;		
	
	sei();								/* äÑÇËçûÇ›ãñâ¬						*/

	while( ON ) {
		SYS_asy();
		APP_blinkLED( BLK_LED_NOM, 0 );	

/*	--- for debug with simulator -------------------------------------------*/
//		CRT_icf1_GRP160_120();			/* for simulator					*/
//		APP_Display_ram();
//		APP_Famima();
/*	------------------------------------------------------------------------*/
	}
	
}

